2020-08-06_12-03-20.394180/merged.yml
---
execution:
- concurrency: 100
  executor: jmeter
  ramp-up: 10s
  run-items:
  - loadtests.ClientAPITest#pre1
  scenario: apiCall
reporting:
- module: junit-xml
scenarios:
  apiCall:
    additional-classpath:
    - target/*
    script: ./src/test/java/loadtests
services:
- module: shellexec
  prepare: mvn -Dmaven.test.skip=true  clean package